namespace AldagiTPL.Models
{
    public class TPLConditions
    {
        /*TPL-ის პირობები: ლიმიტი (მაქსიმალური თანხა რომელიც შეიძლება ანაზღაურდეს). 
                ეს ველი ივსება წინასწარ განსაზღვრული მნიშვნელობებით, თავისმხრივ, 
                განსაზღვრავს თუ რამდენი პრემია (დაზღვევის ღირებულება) 
                უნდა გადაიხადოს დაზღვეულმა და დამოკიდებულია თუ რომელი გარე სისტემა ცდილობს განაცხადის რეგისტრაციას, 
                მაგ. პირველი ინტეგრაციის ფარგლებში 5000 ლარიან ლიმიტზე 
                შეიძლება იყოს პრემია 50 ლარი როცა მეორე ინტეგრაციის ფარგლებში განისაზღვრებოდეს 40 ლარით. 
                ასევე შეიძლება რაღაც ლიმიტი პირველ სისტემას ქონდეს და მეორეს არა.*/
    }
}
